saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Maxim.MAX32650.1.1.0-a.pdsc
      <example name="AES" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/AES" >
         <description>AES Demo</description>
         <board name="MAX32651_EVKIT" vendor="Maxim" />
         <project>
            <environment name="uv" load="ARM/AES.uvprojx"/>
            <environment name="iar" load="IAR/AES.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32651 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup" />
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="AES"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC" />
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Display</keyword>
         </attributes>
      </example>

      <example name="CLCD" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/CLCD">
         <description>CLCD Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/CLCD.uvprojx"/>
            <environment name="iar" load="IAR/CLCD.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="CLCD"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC" />
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Display</keyword>
         </attributes>
      </example>

      <example name="EMCC" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/EMCC">
         <description>External Memory Cache Controller Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/EMCC.uvprojx"/>
            <environment name="iar" load="IAR/EMCC.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="EMCC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
            <keyword>Display</keyword>
         </attributes>
      </example>

      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/Hello_World.uvprojx"/>
            <environment name="iar" load="Hello_World.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC" />
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="UART" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/UART">
         <description>UART Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/UART.uvprojx"/>
            <environment name="iar" load="IAR/UART.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="SDHC_FAT" doc="ARM/Abstract.txt" folder="Boards/Maxim/MAX32650_EVKIT/SDHC_FAT">
         <description>SDHC Fat File System Demo</description>
         <board name="MAX32650_EVKIT" vendor="Maxim"/>
         <project>
            <environment name="uv" load="ARM/SDHC_FAT.uvprojx"/>
            <environment name="iar" load="IAR/SDHC_FAT.ewp" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32650 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cclass="Device" Cgroup="Startup"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="SDHC"/>
            <component Cclass="Device" Cgroup="PeriphDriver" Csub="XiP Flash"/>
            <component Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cgroup="Board Support"/>
            <component Cbundle="MAXSDHC" Cclass="MAXSDHC" Cgroup="MAXSDHC"/>
            <component Cbundle="MAXFAT" Cclass="FAT32" Cgroup="MAXFAT"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

