saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Maxim.MAX32650.1.1.0-a.pdsc
      <!-- AES - MAX32651 Only -->
      <condition id="MAX32651 CMSIS AES">
         <description>Advanced Encryption Standard</description>
         <require condition="MAX32651 Device"/>
         <require condition="MAX32651 CMSIS-CORE"/>
      </condition>

      <!-- Color LCD/TFT Peripheral -->
      <condition id="MAX32650 CMSIS CLCD">
         <description>Color LCD-TFT Controller</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- Standard DMA Peripheral -->
      <condition id="MAX32650 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- External Memory Cache Controller Peripheral -->
      <condition id="MAX32650 CMSIS EMCC">
         <description>External Memory Cache Controller (EMCC)</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- Hyperbus Peripheral -->
      <condition id="MAX32650 CMSIS HYPER">
         <description>Hyperbus/Xcella Bus</description>
         <require condition="MAX32650 CMSIS SPI"/>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- FLash IAP Peripheral -->
      <condition id="MAX32650 CMSIS IAP">
         <description>Internal Flash In-Application Programming</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- I2C -->
      <condition id="MAX32650 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- I2S -->
      <condition id="MAX32650 CMSIS I2S">
         <description>I2S Interface</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- OWM -->
      <condition id="MAX32650 CMSIS OWM">
         <description>1-Wire Master Interface</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- PT -->
      <condition id="MAX32650 CMSIS PT">
         <description>Pulse Train Engine</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
      <condition id="MAX32650 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
      <condition id="MAX32650 CMSIS SDHC">
         <description>SD Host Controller</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32650 CMSIS SPI XIP RAM">
         <description>SPI-XiP RAM Interface</description>
         <require condition="MAX32650 CMSIS SPI"/>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32650 CMSIS SPI XIP FLASH">
         <description>SPI-XiP Flash Interface</description>
         <require condition="MAX32650 CMSIS SPI"/>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32650 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32650 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32650 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32650 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <condition id="MAX32650 BSP">
         <description>Board Support Package</description>
         <require condition="MAX32650 CMSIS-CORE"/>
         <accept condition="MAX32650 Device"/>
         <accept condition="MAX32651 Device"/>
         <accept condition="MAX32652 Device"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="XiP Flash"/>
      </condition>

      <condition id="MAX32651 BSP">
         <description>Board Support Package</description>
         <require condition="MAX32650 CMSIS-CORE"/>
         <require condition="MAX32651 Device"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="SPI"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="I2C"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="UART"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="XiP Flash"/>
      </condition>

      <condition id="Maxim USB High-Speed">
         <description>MAXUSB Libraries</description>
         <require Dvendor="Maxim:23"/>
         <require condition="MAX32650 CMSIS-CORE"/>
      </condition>

      <condition id="Maxim SDHC">
         <description>Maxim SDHC Libraries</description>
         <require Dvendor="Maxim:23"/>
         <require condition="MAX32650 CMSIS-CORE"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="SDHC"/>
      </condition>

      <condition id="Maxim FAT32">
         <description>FAT/exFAT Filesystem</description>
         <require condition="MAX32650 CMSIS-CORE"/>
         <require Cclass="Device" Cgroup="PeriphDriver" Csub="SDHC"/>
      </condition>

   </conditions>

   <components>

      <!-- MAX32650 Device Selection -->
      <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0-a" condition="MAX32650 Device" >
         <description>System Startup for Maxim MAX32650 Microcontroller</description>
         <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define TARGET MAX32650   /* Target Device Part Number */
               #define TARGET_REV 0x4131 /* Target Device Revision Number */
               #define TARGET_NUM 32650 /* Just the number of the target part */
         </RTE_Components_h>
         <files>
            <!-- Include paths for the tools -->
            <file category="include" name="Libraries/Device/Maxim/MAX32650/Include/" version="1.1.0-a" />
            <file category="include" name="Libraries/MAX32650PeriphDriver/Include/" version="1.1.0-a" />

            <!-- Keil/ARM device startup file and sub_main to call SystemInit -->
            <file category="sourceAsm" attr="config" version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/ARM/startup_max32650.s" condition="Startup ARM" />
            <!-- <file category="sourceAsm" attr="config" version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/ARM/sub_main.c" condition="Startup ARM" /> -->
            <!-- GNUC/Eclipse device startup file -->
            <file category="sourceAsm" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/GCC/startup_max32650.S" condition="Startup GCC" />

