saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Maxim.MAX32650.1.1.0-a.pdsc
            <!-- IAR device startup file, low level init and cmain.s -->
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32650/Source/IAR/startup_max32650.s" condition="Startup IAR" version="1.1.0-a" />
            <file category="sourceC" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/IAR/low_level_init.c" condition="Startup IAR" />
            <file category="sourceAsm" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/IAR/cmain.s" condition="Startup IAR" />

            <!-- System, NVIC and device header files common to all platforms -->
            <file category="sourceC" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/system_max32650.c" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/nvic_table.c" version="1.1.0-a" />
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32650/Include/max32650.h" version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/gpio.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/icc.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/lp.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_assert.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_delay.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_lock.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_pins.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_sys.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/rtc.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/nvic_table.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/sema.c"  version="1.1.0-a" />
         </files>
      </component>

      <!-- MAX32651 Device Selection -->
      <component Cclass="Device" Cgroup="Startup" Cversion="1.1.0-a" condition="MAX32651 Device" >
         <description>System Startup for Maxim MAX32651 Microcontroller</description>
         <RTE_Components_h>
               <!-- the following content goes into file 'RTE_Components.h' -->
               #define TARGET MAX32650   /* Target Device Part Number */
               #define TARGET_REV 0x4131 /* Target Device Revision Number */
               #define TARGET_NUM 32650 /* Just the number of the target part */
         </RTE_Components_h>
         <files>
            <!-- Include paths for the tools -->
            <file category="include" name="Libraries/Device/Maxim/MAX32650/Include/" version="1.1.0-a" />
            <file category="include" name="Libraries/MAX32650PeriphDriver/Include/" version="1.1.0-a" />

            <!-- Keil/ARM device startup file and sub_main to call SystemInit -->
            <file category="sourceAsm" attr="config" version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/ARM/startup_max32650.s" condition="Startup ARM" />
            <!-- <file category="sourceAsm" attr="config" version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/ARM/sub_main.c" condition="Startup ARM" /> -->

            <!-- GNUC/Eclipse device startup file -->
            <file category="sourceAsm" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/GCC/startup_max32650.S" condition="Startup GCC" />

            <!-- IAR device startup file, low level init and cmain.s -->
            <file category="sourceAsm" attr="config" name="Libraries/Device/Maxim/MAX32650/Source/IAR/startup_max32650.s" condition="Startup IAR" version="1.1.0-a" />
            <file category="sourceC" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/IAR/low_level_init.c" condition="Startup IAR" />
            <file category="sourceAsm" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/IAR/cmain.s" condition="Startup IAR" />

            <!-- System, NVIC and device header files common to all platforms -->
            <file category="sourceC" attr="config"  version="1.1.0-a" name="Libraries/Device/Maxim/MAX32650/Source/system_max32650.c" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/nvic_table.c" version="1.1.0-a" />
            <file category="header" attr="config" name="Libraries/Device/Maxim/MAX32650/Include/max32650.h" version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/gpio.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/icc.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/lp.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mem_utils.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_assert.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_delay.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_lock.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_pins.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/mxc_sys.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/rtc.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/nvic_table.c"  version="1.1.0-a" />
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/sema.c"  version="1.1.0-a" />
         </files>
      </component>

