saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Maxim.MAX32650.1.1.0-a.pdsc
      <component Cclass="Device" Cgroup="PeriphDriver" Csub="Pulse Train" condition="MAX32650 CMSIS PT" Cversion="1.1.0-a">
         <description>Pulse Train Engine</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/pt.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="RTC" condition="MAX32650 CMSIS RTC" Cversion="1.1.0-a">
         <description>Real-Time Clock</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/rtc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="SDHC" condition="MAX32650 CMSIS SDHC" Cversion="1.1.0-a">
         <description>SD Host Controller</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/sdhc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="SPI" condition="MAX32650 CMSIS SPI" Cversion="1.1.0-a">
         <description>SPI Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/spi.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/spi17y.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/spid.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="XiP RAM" condition="MAX32650 CMSIS SPI XIP RAM" Cversion="1.1.0-a">
         <description>SPI eXecute In Place (XIP) Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/spixc.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/emcc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="XiP Flash" condition="MAX32650 CMSIS SPI XIP FLASH" Cversion="1.1.0-a">
         <description>SPI eXecute In Place (XIP) Interface For External Code Execution</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/spixc.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="Timers" condition="MAX32650 CMSIS TIMER" Cversion="1.1.0-a">
         <description>32-Bit Timers</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/tmr.c" version="1.1.0-a"/>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/tmr_utils.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="Watchdog" condition="MAX32650 CMSIS WDT" Cversion="1.1.0-a">
         <description>Watchdog Timers</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/wdt.c" version="1.1.0-a"/>
         </files>
      </component>

      <component Cclass="Device" Cgroup="PeriphDriver" Csub="UART" condition="MAX32650 CMSIS UART" Cversion="1.1.0-a">
         <description>UART Interface</description>
         <files>
            <file category="sourceC" name="Libraries/MAX32650PeriphDriver/Source/uart.c" version="1.1.0-a"/>
         </files>
      </component>

      <bundle Cbundle="MAX32650 KIT BSP" Cclass="BSP" Cversion="1.1.0-a">
         <description>MAX32650 Evaluation Kit Board Support Package</description>
         <doc>https://datasheets.maximintegrated.com/en/ds/MAX32650-EVKIT.pdf</doc>
         <component Cgroup="Board Support" condition="MAX32650 BSP">
            <description>MAX32650 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */
            </RTE_Components_h>
            <files>
               <file category="doc" name="https://datasheets.maximintegrated.com/en/ds/MAX32650EVKIT.pdf"/>
               <file category="include" name="Boards/Maxim/MAX32650_EVKIT/Common/EvKit_V1/Include/"/>
               <file category="include" name="Boards/Maxim/MAX32650_EVKIT/Common/Include/"/>
               <file category="sourceC" name="Boards/Maxim/MAX32650_EVKIT/Common/EvKit_V1/Source/board.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32650_EVKIT/Common/Source/stdio.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32650_EVKIT/Common/Source/pb.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32650_EVKIT/Common/Source/led.c" version="1.1.0-a"/>
               <file category="sourceC" name="Boards/Maxim/MAX32650_EVKIT/Common/Source/mx25.c" version="1.1.0-a"/>
           </files>
         </component>
      </bundle>

      <bundle Cbundle="MAXUSB_HS" Cclass="MAXUSB_HS" Cversion="1.1.0-a">
         <description>MAXUSB Libraries for the Maxim Integrated ARM Cortex Family of Microcontrollers</description>
         <doc>https://datasheets.maximintegrated.com/en/ds/MAX32650-EVKIT.pdf</doc>
         <component Cgroup="MAXUSB_HS" condition="Maxim USB High-Speed">
            <description>Maxim Integrated USB libraries for the ARM Cortex.</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/" version="1.1.0-a"/>
               <file category="include" name="Libraries/MAXUSB/include/core/" version="1.1.0-a"/>
               <file category="include" name="Libraries/MAXUSB/include/devclass/" version="1.1.0-a"/>
               <file category="include" name="Libraries/MAXUSB/include/enumerate/" version="1.1.0-a"/>
               <file category="include" name="Libraries/MAXUSB/include/core/musbhsfc/" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/musbhsfc/usb.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/usb_event.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/fifo.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/cdc_acm.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/msc.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_kbd.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_raw.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/enumerate/enumerate.c" version="1.1.0-a"/>
            </files>
         </component>
      </bundle>

      <bundle Cbundle="MAXSDHC" Cclass="MAXSDHC" Cversion="1.1.0-a">
         <description>SDHC Library for the MAX32650 Device Family</description>
         <doc>Libraries/SDHC/ff13/documents/00index_e.html</doc>
         <component Cgroup="MAXSDHC" condition="Maxim SDHC">
            <description>SDHC Library for the MAX32650 Part Family</description>
            <files>
               <file category="header" attr="config" name="Libraries/SDHC/Source/sdhc_lib.h" version="1.1.0-a"/>
               <file category="header" name="Libraries/SDHC/Source/sdhc_resp_regs.h" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/SDHC/Source/sdhc_lib.c" version="1.1.0-a"/>
            </files>
         </component>
      </bundle>

      <bundle Cbundle="MAXFAT" Cclass="FAT32" Cversion="1.1.0-a">
         <description>FAT exFAT Filesystem Library</description>
         <doc>Libraries/SDHC/ff13/documents/00index_e.html</doc>
         <component Cgroup="MAXFAT" condition="Maxim FAT32">
            <description>Fat Filesystem for SDHC on the MAX32650 Device Family</description>
            <files>
               <file category="header" attr="config" name="Libraries/SDHC/ff13/Source/ffconf.h" version="1.1.0-a"/>
               <file category="header" name="Libraries/SDHC/ff13/Source/ff.h" version="1.1.0-a"/>
               <file category="header" name="Libraries/SDHC/ff13/Source/diskio.h" version="1.1.0-a"/>
               <file category="header" name="Libraries/SDHC/ff13/Source/integer.h" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/diskio.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ff.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ffsystem.c" version="1.1.0-a"/>
               <file category="sourceC" name="Libraries/SDHC/ff13/Source/ffunicode.c" version="1.1.0-a"/>
            </files>
         </component>
      </bundle>

   </components>

</package>